STMicroelectronics/x-cube-tcpp/Drivers/CMSIS/Device/ST/STM32G4xx/Include/stm32g4xxxxx.h
#if defined (STM32G471xx) || defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx) || defined (STM32G491xx) || defined (STM32G4A1xx)
#define FLASH_BASE            (0x08000000UL) /*!< FLASH (up to 512 kB) base address */
#elif defined (STM32G431xx) || defined (STM32G441xx) || defined (STM32GBK1CB)
#define FLASH_BASE            (0x08000000UL) /*!< FLASH (up to 128 kB) base address */
#endif /* (STM32G471xx) || (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) || (STM32G491xx) || (STM32G4A1xx) */
#if defined (STM32G471xx) || defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define SRAM1_BASE            (0x20000000UL) /*!< SRAM1(up to 80 KB) base address */
#define SRAM2_BASE            (0x20014000UL) /*!< SRAM2(16 KB) base address */
#define CCMSRAM_BASE          (0x10000000UL) /*!< CCMSRAM(32 KB) base address */
#elif defined (STM32G491xx) || defined (STM32G4A1xx)
#define SRAM1_BASE            (0x20000000UL) /*!< SRAM1(up to 80 KB) base address */
#define SRAM2_BASE            (0x20014000UL) /*!< SRAM2(16 KB) base address */
#define CCMSRAM_BASE          (0x10000000UL) /*!< CCMSRAM(16 KB) base address */
#elif defined (STM32G431xx) || defined (STM32G441xx) || defined (STM32GBK1CB)
#define SRAM1_BASE            (0x20000000UL) /*!< SRAM1(up to 16 KB) base address */
#define SRAM2_BASE            (0x20004000UL) /*!< SRAM2(6 KB) base address */
#define CCMSRAM_BASE          (0x10000000UL) /*!< CCMSRAM(10 KB) base address */
#endif /* (STM32G471xx) || (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */
#define PERIPH_BASE           (0x40000000UL) /*!< Peripheral base address */
#if defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define FMC_BASE              (0x60000000UL) /*!< FMC base address */
#endif /* (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */
#if defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx) || defined (STM32G491xx) || defined (STM32G4A1xx)
#define QSPI_BASE             (0x90000000UL) /*!< QUADSPI memories accessible over AHB base address */
#endif /* (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) || (STM32G491xx) || (STM32G4A1xx) */

#if defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define FMC_R_BASE            (0xA0000000UL) /*!< FMC  control registers base address */
#endif /* (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */
#if defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx) || defined (STM32G491xx) || defined (STM32G4A1xx)
#define QSPI_R_BASE           (0xA0001000UL) /*!< QUADSPI control registers base address */
#endif /* (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) || (STM32G491xx) || (STM32G4A1xx) */
#if defined (STM32G471xx) || defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define SRAM1_BB_BASE         (0x22000000UL) /*!< SRAM1(80 KB) base address in the bit-band region */
#define SRAM2_BB_BASE         (0x22280000UL) /*!< SRAM2(16 KB) base address in the bit-band region */
#define CCMSRAM_BB_BASE       (0x22300000UL) /*!< CCMSRAM(32 KB) base address in the bit-band region */
#elif defined (STM32G491xx) || defined (STM32G4A1xx)
#define SRAM1_BB_BASE         (0x22000000UL) /*!< SRAM1(80 KB) base address in the bit-band region */
#define SRAM2_BB_BASE         (0x22280000UL) /*!< SRAM2(16 KB) base address in the bit-band region */
#define CCMSRAM_BB_BASE       (0x22300000UL) /*!< CCMSRAM(16 KB) base address in the bit-band region */
#elif defined (STM32G431xx) || defined (STM32G441xx) || defined (STM32GBK1CB)
#define SRAM1_BB_BASE         (0x22000000UL) /*!< SRAM1(16 KB) base address in the bit-band region */
#define SRAM2_BB_BASE         (0x22080000UL) /*!< SRAM2(6 KB) base address in the bit-band region */
#define CCMSRAM_BB_BASE       (0x220B0000UL) /*!< CCMSRAM(10 KB) base address in the bit-band region */
#endif /* (STM32G471xx) || (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */
#define PERIPH_BB_BASE        (0x42000000UL) /*!< Peripheral base address in the bit-band region */
/* Legacy defines */
#define SRAM_BASE             SRAM1_BASE
#define SRAM_BB_BASE          SRAM1_BB_BASE

#if defined (STM32G471xx) || defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define SRAM1_SIZE_MAX        (0x00014000UL) /*!< maximum SRAM1 size (up to 80 KBytes) */
#define SRAM2_SIZE            (0x00004000UL) /*!< SRAM2 size (16 KBytes) */
#define CCMSRAM_SIZE          (0x00008000UL) /*!< CCMSRAM size (32 KBytes) */
#elif defined (STM32G491xx) || defined (STM32G4A1xx)
#define SRAM1_SIZE_MAX        (0x00014000UL) /*!< maximum SRAM1 size (up to 80 KBytes) */
#define SRAM2_SIZE            (0x00004000UL) /*!< SRAM2 size (16 KBytes) */
#define CCMSRAM_SIZE          (0x00004000UL) /*!< CCMSRAM size (16 KBytes) */
#elif defined (STM32G431xx) || defined (STM32G441xx) || defined (STM32GBK1CB)
#define SRAM1_SIZE_MAX        (0x00004000UL) /*!< maximum SRAM1 size (up to 16 KBytes) */
#define SRAM2_SIZE            (0x00001800UL) /*!< SRAM2 size (6 KBytes) */
#define CCMSRAM_SIZE          (0x00002800UL) /*!< CCMSRAM size (10 KBytes) */
#endif /* (STM32G471xx) || (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE        PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000UL)

#if defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define FMC_BANK1             FMC_BASE
#define FMC_BANK1_1           FMC_BANK1
#define FMC_BANK1_2           (FMC_BANK1 + 0x04000000UL)
#define FMC_BANK1_3           (FMC_BANK1 + 0x08000000UL)
#define FMC_BANK1_4           (FMC_BANK1 + 0x0C000000UL)
#define FMC_BANK3             (FMC_BASE  + 0x20000000UL)
#endif /* (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */

/*!< APB1 peripherals */
#define TIM2_BASE             (APB1PERIPH_BASE + 0x0000UL)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x0400UL)
#define TIM4_BASE             (APB1PERIPH_BASE + 0x0800UL)
#if defined (STM32G471xx) || defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define TIM5_BASE             (APB1PERIPH_BASE + 0x0C00UL)
#endif /* (STM32G471xx) || (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */
#define TIM6_BASE             (APB1PERIPH_BASE + 0x1000UL)
#define TIM7_BASE             (APB1PERIPH_BASE + 0x1400UL)
#define CRS_BASE              (APB1PERIPH_BASE + 0x2000UL)
#define TAMP_BASE             (APB1PERIPH_BASE + 0x2400UL)
#define RTC_BASE              (APB1PERIPH_BASE + 0x2800UL)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00UL)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x3000UL)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800UL)
#define SPI3_BASE             (APB1PERIPH_BASE + 0x3C00UL)
#define USART2_BASE           (APB1PERIPH_BASE + 0x4400UL)
#define USART3_BASE           (APB1PERIPH_BASE + 0x4800UL)
#if defined (STM32G431xx) || defined (STM32G441xx) || defined (STM32G471xx) || defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx) || defined (STM32G491xx) || defined (STM32G4A1xx)
#define UART4_BASE            (APB1PERIPH_BASE + 0x4C00UL)
#endif /* (STM32G431xx) || (STM32G441xx) || (STM32G471xx) || (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) || (STM32G491xx) || (STM32G4A1xx) */
#if defined (STM32G471xx) || defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx) || defined (STM32G491xx) || defined (STM32G4A1xx)
#define UART5_BASE            (APB1PERIPH_BASE + 0x5000UL)
#endif /* (STM32G471xx) || (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) || (STM32G491xx) || (STM32G4A1xx) */
#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400UL)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x5800UL)
#define USB_BASE              (APB1PERIPH_BASE + 0x5C00UL)  /*!< USB_IP Peripheral Registers base address */
#define USB_PMAADDR           (APB1PERIPH_BASE + 0x6000UL)  /*!< USB_IP Packet Memory Area base address */
#define FDCAN1_BASE           (APB1PERIPH_BASE + 0x6400UL)
#define FDCAN_CONFIG_BASE     (APB1PERIPH_BASE + 0x6500UL)  /*!< FDCAN configuration registers base address */
#if defined (STM32G471xx) || defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx) || defined (STM32G491xx) || defined (STM32G4A1xx)
#define FDCAN2_BASE           (APB1PERIPH_BASE + 0x6800UL)
#endif /* (STM32G471xx) || (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) || (STM32G491xx) || (STM32G4A1xx) */
#if defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define FDCAN3_BASE           (APB1PERIPH_BASE + 0x6C00UL)
#endif /* (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */
#define PWR_BASE              (APB1PERIPH_BASE + 0x7000UL)
#define I2C3_BASE             (APB1PERIPH_BASE + 0x7800UL)
#define LPTIM1_BASE           (APB1PERIPH_BASE + 0x7C00UL)
#define LPUART1_BASE          (APB1PERIPH_BASE + 0x8000UL)
#if defined (STM32G471xx) || defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define I2C4_BASE             (APB1PERIPH_BASE + 0x8400UL)
#endif /* (STM32G471xx) || (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */
#define UCPD1_BASE            (APB1PERIPH_BASE + 0xA000UL)
#define SRAMCAN_BASE          (APB1PERIPH_BASE + 0xA400UL)

/*!< APB2 peripherals */
#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x0000UL)
#if defined (STM32G431xx) || defined (STM32G441xx) || defined (STM32G471xx) || defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx) || defined (STM32G491xx) || defined (STM32G4A1xx)
#define VREFBUF_BASE          (APB2PERIPH_BASE + 0x0030UL)
#endif /* (STM32G431xx) || (STM32G441xx) || (STM32G471xx) || (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) || (STM32G491xx) || (STM32G4A1xx) */
#define COMP1_BASE            (APB2PERIPH_BASE + 0x0200UL)
#define COMP2_BASE            (APB2PERIPH_BASE + 0x0204UL)
#define COMP3_BASE            (APB2PERIPH_BASE + 0x0208UL)
#define COMP4_BASE            (APB2PERIPH_BASE + 0x020CUL)
#if defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define COMP5_BASE            (APB2PERIPH_BASE + 0x0210UL)
#define COMP6_BASE            (APB2PERIPH_BASE + 0x0214UL)
#define COMP7_BASE            (APB2PERIPH_BASE + 0x0218UL)
#endif /* (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */
#define OPAMP_BASE            (APB2PERIPH_BASE + 0x0300UL)
#define OPAMP1_BASE           (APB2PERIPH_BASE + 0x0300UL)
#define OPAMP2_BASE           (APB2PERIPH_BASE + 0x0304UL)
#define OPAMP3_BASE           (APB2PERIPH_BASE + 0x0308UL)
#if defined (STM32G473xx) || defined (STM32G474xx) || defined (STM32G483xx) || defined (STM32G484xx)
#define OPAMP4_BASE           (APB2PERIPH_BASE + 0x030CUL)
#define OPAMP5_BASE           (APB2PERIPH_BASE + 0x0310UL)
#define OPAMP6_BASE           (APB2PERIPH_BASE + 0x0314UL)
#elif defined (STM32G491xx) || defined (STM32G4A1xx)
#define OPAMP6_BASE           (APB2PERIPH_BASE + 0x0314UL)
#endif /* (STM32G473xx) || (STM32G474xx) || (STM32G483xx) || (STM32G484xx) */

